# audio --- first install pipewire to avoid pulseaudio
alsa-utils
alsa-plugins
pipewire 
pipewire-jack 
pipewire-alsa 
pipewire-pulse
gst-plugin-pipewire 
sof-firmware
#
xorg-server
xorg-apps
xorg-xinit
#now procced as usual
mesa
linux-headers
usbutils
xdg-user-dirs
xdg-utils
iw
wpa_supplicant
git
reflector
lshw
unzip
htop
wget
# for "man" command
man-db
### old end of minimal
# awesome-terminal-fonts
bluez
bluez-libs
bluez-utils
blueman
btrfs-progs
# code
cronie
cups
dialog
efibootmgr
exfat-utils
gparted
gptfdisk
htop
ntfs-3g
os-prober
python
python-pip
zip
