# audio --- first install pipewire to avoid pulseaudio
alsa-utils
alsa-plugins
pipewire 
pipewire-jack 
pipewire-alsa 
pipewire-pulse
gst-plugin-pipewire 
sof-firmware
#
xorg-server
xorg-apps
xorg-xinit
#now procced as usual
mesa
linux-headers
usbutils
xdg-user-dirs
xdg-utils
iw
wpa_supplicant
git
reflector
lshw
unzip
htop
wget
# for "man" command
man-db
### old end of minimal
# awesome-terminal-fonts
bluez
bluez-libs
bluez-utils
blueman
btrfs-progs
# code
cronie
cups
dialog
efibootmgr
exfat-utils
gparted
gptfdisk
htop
ntfs-3g
os-prober
python
python-pip
zip
##########################################
###   MY PACKAGES
##########################################
grep
openjpeg2
openresolv
openssl
openconnect
openvpn
networkmanager
networkmanager-openconnect
networkmanager-openvpn
firefox
netctl
rclone
#### FONTS --------
noto-fonts
ttf-ubuntu-font-family
ttf-dejavu
ttf-freefont
ttf-liberation
ttf-droid
ttf-roboto
terminus-font
--END OF MINIMAL INSTALL--
obs-studio
# okular
qgis
translate-shell
sane
gscan2pdf
# TEXLIVE-MOST-------
texlive-bibtexextra
texlive-core
#texlive-fontsextra
#texlive-formatsextra
#texlive-games
#texlive-humanities
texlive-latexextra
#texlive-music
#texlive-pictures
#texlive-pstricks
#texlive-publishers
texlive-science
libreoffice-still
jre-openjdk
